var sourceList = {
  name: '大雪满弓刀',
  chaper: '第二回 大雪论刀',
  list: [
    'https://hbimg.huabanimg.com/9258f155ba75e60a9d5d7fe75b0d8926298b5094167f3-vulYXn_fw658',
    'https://hbimg.huabanimg.com/85a2572d5c594dc03aa40b0c040f0f9b579a563119343-CrN3dL_fw658',
    'https://hbimg.huabanimg.com/857b0723b7efe71fe13a5b71833e2858647703c32181a-qXc75D_fw658',
    'https://hbimg.huabanimg.com/1ac8233816a13829cec5ed30e3c50421eeb619021be391-aO6Bms_fw658'
  ]

}

var pageData = [

  {
    type: 'txt',
    data: [
      ['大雪漫天', 1000],
      ['雪坪上有两人，一坐一站', 1400],
      ['万籁俱寂, 有风刮过 雪染肩头', 2000],
      ['少顷, 坐立男子抬头, 目视另一人， 开口说道', 2000],
    ]
  }, {
    type: 'dialog',
    person: ['A', 'B'],
    data: [
      ['阴三, 江湖人称三更鬼', 'A', 1],
      ['正月十二, 扬州 杀镇远镖局满门一百二十八口', 'A', 1],
      ['三月初六, 幽州 杀长臂神拳刘泉', 'A', 1],
      ['五月初四, 沧州 毒杀清风寨上下三百五十六人...', 'A', 1],
      ['呵... 这些都是在下所为', 'B', 1],
      ['但是你少说了一桩', 'B', 1],
      ['什么', 'A', 1],
      ['十二月二十八 杀神刀山庄少庄主林峰于华山大雪坪', 'B', 2],
      ['是么... 不过阁下也少说了一桩', 'A', 2],
      ['呵呵... 愿闻其详', 'B', 2],
      ['三更鬼死于此地', 'A', 1],
    ]
  }, {
    type: 'txt',
    data: [
      ['潇杀的气氛于风雪中弥漫', 1400],
      ['阴三突然笑了起来', 2000],
    ]
  },
  {
    type: 'dialog',
    person: ['A', 'B'],
    data: [
      ['哈哈哈哈... 这么说. 今日可是少庄主设的局', 'B', 1],
      ['不错', 'A', 1],
      ['从你于华阴接受赏格 便是棋局开始', 'A', 1],
      ['一路为引你入局，多年暗柱毁去十之八九', 'A', 1],
      ['今日.. 你必死', 'A', 1],
    ]
  }, {
    type: 'txt',
    data: [
      ['阴三看着眼前的男子 沉思良久', 1500]
    ]
  },
  {
    type: 'dialog',
    person: ['A', 'B'],
    data: [
      ['看来 是我大意了', 'B', 2],
      ['不过今日入局 为了让我大意 方圆十里内必定没有他人', 'B', 2],
      ['那么 谁死谁生 现在说 为时过早吧...', 'B', 1],
      ['那就来试试吧...', 'A', 2],
    ]
  }, {
    type: 'txt',
    data: [
      ['刀剑已出鞘', 1000],
      ['风雪骤停 云开日出', 1200],
      ['两人身影在雪地上划出两道狭长的伤口', 2000],
      ['刹那，两人身形已动', 1500],
    ]
  }, {
    type: 'cartoon',
    id: '1',
    data: [
      ['./src/img/pic-mh-1.png', 'l', 300],
      ['./src/img/pic-mh-dd.png', 'r', 500],
      ['./src/img/pic-mh-2.png', 'l', 600],
      ['./src/img/pic-mh-3.png', 'l', 800],
      ['./src/img/pic-mh-4.png', 'r', 600],
    ]
  }, {
    type: 'txt',
    data: [
      ['刀剑无影', 1000],
      ['血染苍穹', 1000],
      ['预知后事如何', 1200],
      ['请听下回分解~', 1200],
    ]
  },


]